export default function Mendchilgee() {
  return (
    <div className="max-w-5xl mx-auto px-8 py-16 text-gray-800">
      {/* Гарчиг */}
      <h1 className="text-4xl font-semibold mb-8 text-center">
        Захирлын мэндчилгээ
      </h1>

      {/* Мэндчилгээний текст */}
      <p className="text-xl leading-relaxed mb-6">
        Эрхэм хүндэт эцэг эхчүүд, багш сурган хүмүүжүүлэгчид, сурагчид болон
        манай сургуулийн үйл ажиллагаатай танилцаж буй та бүхэнд энэ өдрийн
        мэндийг хүргэе. Ерөнхий боловсролын сургуулийн сурагчдын авьяас билгийг
        тодруулан, хөгжил төлөвшлийг дэмжиж, хүүхдийн цаашид суралцах чиг
        баримжааг тодорхойлох, мөн Хөвсгөл нутгийн 6 ястны өв соёлыг өвлүүлэн
        хөгжүүлэх эрхэм зорилготойгоор 2010 онд “Авьяас” сургууль үүсгэн
        байгуулагдсан билээ.
      </p>

      <p className="text-xl leading-relaxed mb-6">
        Манай хамт олон өнөөдрийг хүртэл хүүхэд бүрийн авьяас, чадварыг нээн
        илрүүлэх, сурч боловсрох хүсэл тэмүүллийг дэмжих, үндэсний соёл
        уламжлалаа хадгалж өвлүүлэхийн зэрэгцээ, орчин үеийн боловсролын
        чанартай мэдлэг олгох үйлсэд тууштай ажиллаж байна. Сурагчдын хөгжлийг
        дэмжих зорилгоор бид англи хэлний хөтөлбөр, оюун ухаан хөгжүүлэх
        сургалтуудыг хэрэгжүүлж, хүүхдүүдийг зөвхөн орон нутгийн төдийгүй
        дэлхийн иргэн болон төлөвшихөд нь хувь нэмэр оруулж байна.
      </p>

      <p className="text-xl leading-relaxed mb-6">
        Ингэснээр бид хүүхэд бүрийн ирээдүйг гэрэлтүүлэн, орон нутгийн хөгжил,
        улс орны ирээдүйд үнэтэй хөрөнгө оруулалт хийж байна гэдэгт итгэлтэй
        байдаг. Та бүхэнд эрүүл энх, сайн сайхан бүхнийг хүсэн ерөөе. Манай
        сургуулийн үйл ажиллагаанд итгэж, дэмжиж хамтран ажилладаг та бүхэнд гүн
        талархал илэрхийлье.
      </p>

      {/* Захирал */}
      <p className="text-2xl font-medium mt-8 text-right">
        Хүндэтгэсэн, <br />
        “Авьяас” сургуулийн захирал Г.Анхтуяа
      </p>
    </div>
  );
}
