export default function Namtar() {
  return (
    <div className="max-w-5xl mx-auto px-8 py-16 text-gray-800">
      <h2 className="text-4xl font-bold text-gray-800 mb-6 text-center">
        Бидний Тухай
      </h2>

      <div className="space-y-6 text-gray-700 text-xl leading-relaxed">
        <p>
          Ерөнхий боловсролын "Авьяас" сургууль Монгол улсын “Боловсрол”
          Үндэсний хөтөлбөрт тусгагдсан ерөнхий боловсролын сургуулийн бага,
          дунд ангийн сурагчдын авьяас билгийг тодруулан, хөгжлийг дэмжиж,
          хүүхдийн цаашид суралцах чиг баримжааг тодруулан Хөвсгөл нутгийн 6
          ястны өв соёлыг өвлүүлэн хөгжүүлэх зорилгоор байгуулагдсан.
        </p>

        <p>
          Анх Мэргэжлийн сургалттай “Авьяас” VIII сургууль, 2014 онд Монгол
          Улсын Боловсролын тухай хуульд өөрчлөлт орж урлагийн төрөлжсөн
          сургалттай сургууль болж, 2017 онд БСШУ-ны сайдын А/244 дүгээр
          тушаалаар Мөрөн сумын ерөнхий боловсролын “Авьяас” сургууль болсон.
        </p>

        <p>
          2011 оны 01 дүгээр сарын 03-ны өдөр удирдах ажилтан 1, сургалтын
          менежер 1, нийгмийн ажилтан 1, 25 багштайгаар 108 суралцагчтайгаар
          1-11 дүгээр ангийн 10 бүлэгт хичээллэж эхэлсэн. Одоо нийт 33 бүлэгт
          835 суралцагч суралцаж, 94 багш, ажилтан ажиллаж байна.
        </p>
      </div>
    </div>
  );
}
