// context/ClassContext.js
"use client";

import { createContext, useContext, useState } from "react";

// Анги хуваарийн context үүсгэх
const ClassContext = createContext(null);
// Provider компонент
export const ClassProvider = ({ children, initialData }) => {
  const [classes, setClasses] = useState([
    {
      class: "12a",
      pic: "public/Slide1-removebg-preview.png",
      aub: "М.Туул",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Математик ",
            "Англи Хэл",
            "Англи хэл",
            "Биеийн тамир",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Математик",
            "Нийгэм",
            "Англи хэл",
            "Биеийн тамир",
            "Иргэний Ёс Зүй",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол хэл",
            "Технологи",
            "Монгол хэл СОНГОН",
            "Монгол хэл",
            "Мэдээлэл зүй",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Монгол хэл",
            "Нийгэм",
            "Монгол хэл СОНГОН",
            "Монгол хэл",
            "Дүрслэх Урлаг",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Эрүүл мэнд",
            "Нийгэм",
            "Физик СОНГОН",
            "Хими СОНГОН",
            "",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Монгол хэл СОНГОН",
            "Математик сонгон",
            "Физик СОНГОН",
            "Нийгэм СОНГОН",
            "Хими СОНГОН",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "Монгол хэл СОНГОН",
            "Математик сонгон",
            "",
            "Нийгэм СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "12б",
      aub: "Т.Батзаяа",
      pic: "",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Англи хэл ",
            "Дүрслэх Урлаг",
            "Математик",
            "Монгол хэл",
            "Иргэний ёс зүй",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Англи хэл",
            "Технологи",
            "Математик",
            "Монгол хэл",
            "Англи хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Эрүүл мэнд",
            "Иргэний Ёс Зүй",
            "Монгол хэл СОНГОН",
            "Биеийн тамир",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Монгол хэл",
            "Монгол хэл СОНГОН",
            "Монгол хэл СОНГОН",
            "Биеийн тамир",
            "Мэдээлэл зүй",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Монгол хэл",
            "Монгол хэл СОНГОН",
            "Биологи СОНГОН",
            "",
            "Хими СОНГОН",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Нийгэм СОНГОН",
            "",
            "Физик СОНГОН",
            "Нийгэм СОНГОН",
            "Хими СОНГОН",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "Нийгэм СОНГОН",
            "Ангийн ажил",
            "Физик СОНГОН",
            "Нийгэм СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "11а",
      pic: "",
      aub: "Д.Отгонзул",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Газарзүй",
            "Физик",
            "Нийгэм",
            "Технологи",
            "МХУЗ",
          ],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "Газарзүй", "Физик", "Нийгэм", "Хими", "МХУЗ"],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "МХУЗ",
            "Математик",
            "Эрүүл мэнд",
            "Хими",
            "ИЁЗБ",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "МХУЗ",
            "Математик",
            "Математик СОНГОН",
            "Англи хэл",
            "Математик",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Мэдээлэл зүй",
            "Биологи",
            "Математик СОНГОН",
            "Англи хэл",
            "Түүх",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Биеийн тамир",
            "Биологи",
            "Нийгэм",
            "МХУЗ СОНГОН",
            "Англи хэл",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "Биеийн тамир",
            "Зураг зүй",
            "Физик СОНГОН",
            "МХУЗ СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "11б",
      pic: "",
      aub: "Б.Болормаа",
      huwaari: [
        // 1r tsag
        {
          time: ["08:30-09:30", "Биеийн тамир", "Хими", "МХУЗ", "ИЁЗБ", "МХУЗ"],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "Биеийн тамир", "Хими", "МХУЗ", "ИЁЗБ", "МХУЗ"],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Математик",
            "Физик",
            "Дүрслэх урлаг",
            "Технологи",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "Математик", "Физик", "ЭМ", "Биологи", ""],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Газарзүй",
            "Математик СОНГОН",
            "Англи хэл",
            "Биологи",
            "Англи хэл",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Газарзүй",
            "Биологи",
            "Англи хэл",
            "МХУЗ СОНГОН",
            "Түүх",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "Мэдээлэл зүй",
            "",
            "Физик СОНГОН",
            "МХУЗ СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "10а",
      pic: "",
      aub: "Б.Цэвээнсүрэн",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Физик",
            "Математик",
            "Математик",
            "Газарзүй",
            "Технологи",
          ],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "Физик", "Математик", "ЭМ", "Газарзүй", "МХУЗ"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "ИЁЗБ", "МХУЗ", "Биеийн тамир", "ИЁЗБ", "МХУЗ"],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "ИЁЗБ",
            "Англи хэл",
            "Биеийн тамир",
            "Дүрслэх урлаг",
            "Түүх",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Биологи",
            "Англи хэл",
            "Хими",
            "МХУЗ",
            "Англи хэл",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Биологи",
            "Биологи СОНГОН",
            "Хими",
            "Хими СОНГОН",
            "ИЁЗБ",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "МХУЗ СОНГОН",
            "Биологи СОНГОН",
            "Мэдээлэл зүй",
            "Хими СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "10б",
      pic: "",
      aub: "Д.Нарансайхан",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "МХУЗ",
            "Англи хэл",
            "Англи хэл",
            "Математик",
            "Түүх",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "МХУЗ",
            "ИЁЗБ",
            "Англи хэл",
            "Математик",
            "Хими",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Биологи",
            "Газарзүй",
            "Математик",
            "ИЁЗБ",
            "Хими",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Биологи",
            "Газарзүй",
            "Мэдээлэл зүй",
            "Физик",
            "МХУЗ",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Технологи",
            "Дүрслэх урлаг",
            "Биеийн тамир",
            "Физик",
            "МХУЗ",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "ИЁЗБ",
            "Нийгэм СОНГОН",
            "Биеийн тамир",
            "Англи хэл СОНГОН",
            "МХУЗ СОНГОН",
          ],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "ИЁЗБ",
            "Нийгэм СОНГОН",
            "Эрүүл мэнд",
            "Англи хэл СОНГОН",
            "",
          ],
        },
      ],
    },
    {
      class: "10в",
      pic: "",
      aub: "Б.Мөнхжаргал",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "МХУЗ",
            "МT",
            "Биеийн тамир",
            "Физик",
            "Англи хэл",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "МХУЗ",
            "Математик",
            "Биеийн тамир",
            "Физик",
            "Технологи",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Математик",
            "Англи хэл",
            "Биологи",
            "Дүрслэх урлаг",
            "Түүх",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Англи хэл",
            "Биологи",
            "Газарзүй",
            "Нийгэм/ИЁЗБ",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Хими",
            "ИЁЗБ",
            "ЭM",
            "Газарзүй",
            "Нийгэм/ИЁЗБ",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Хими",
            "Англи хэл",
            "МХУЗ",
            "ИЁЗБ СОНГОН",
            "МХУЗ СОНГОН",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "ИЁЗБ", "Англи хэл", "МХУЗ", "ИЁЗБ СОНГОН", ""],
        },
      ],
    },
    {
      class: "9а",
      pic: "",
      aub: "Н.Бат-Уянга",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "МХУЗ",
            "Түүх",
            "Математик",
            "МХУЗ",
            "Англи хэл",
          ],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "МХУЗ", "Түүх", "Математик", "МХУЗ", "Физик"],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Нийгэм",
            "Биеийн тамир",
            "Газарзүй",
            "Математик",
            "Орос хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Биологи",
            "Биеийн тамир",
            "Физик",
            "Математик",
            "Орос хэл",
          ],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "Биологи", "Хими", "МХУЗ", "MT", "МХУЗ"],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "ЭM", "Хими", "Англи хэл", "ИЁЗБ", "МХУЗ"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "Англи хэл", "Орос хэл", ""],
        },
      ],
    },
    {
      class: "9б",
      pic: "",
      aub: "Э.Энхцэцэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Англи хэл",
            "Биеийн тамир",
            "Физик",
            "Англи хэл",
            "Физик",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Биологи",
            "Биеийн тамир",
            "Газарзүй",
            "Англи хэл",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "Биологи", "МХУЗ", "Хими", "MT", "МХУЗ"],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "Нийгэм", "МХУЗ", "Хими", "Математик", "МХУЗ"],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Математик",
            "Түүх",
            "МХУЗ",
            "Математик",
            "Орос хэл",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Хөгжим",
            "Түүх",
            "МХУЗ",
            "Орос хэл",
            "Орос хэл",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "ЭM", "", "ИЁЗБ", "ИЁЗБ", ""],
        },
      ],
    },
    {
      class: "8а",
      pic: "",
      aub: "Т.Халиун",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Нийгэм",
            "Орос хэл",
            "МХУЗ",
            "Биологи",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Нийгэм",
            "МХУЗ",
            "Математик",
            "МХУЗ",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "Физик", "Технологи", "ИЁЗБ", "Түүх", "Хими"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "Физик", "Математик", "Түүх", "Түүх", "Хими"],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "МХУЗ", "Математик", "Хөгжим", "MT", "Биологи"],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "МХУЗ",
            "Биеийн тамир",
            "Англи хэл",
            "Англи хэл",
            "Биологи",
          ],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "Газарзүй",
            "Биеийн тамир",
            "",
            "Англи хэл",
            "",
          ],
        },
      ],
    },
    {
      class: "8б",
      pic: "",
      aub: "Б.Дуламжав",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Mатематик",
            "Англи хэл",
            "ЭМ",
            "Түүх",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Математик",
            "Англи хэл",
            "Биологи",
            "МХУЗ",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "Орос хэл", "Түүх", "Биологи", "МХУЗ", "МХУЗ"],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Орос хэл",
            "Хөгжим",
            "Англи хэл",
            "Биеийн тамир",
            "МХУЗ",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "МХУЗ",
            "Физик",
            "Нийгэм",
            "Биеийн тамир",
            "Хими",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "ИЁЗБ", "Физик", "МХУЗ", "MT", "Хими"],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "ИЁЗБ",
            "Дүрслэх урлаг",
            "",
            "Дүрслэх урлаг",
            "",
          ],
        },
      ],
    },
    {
      class: "8в",
      pic: "",
      aub: "Б.Цэрмаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Англи хэл",
            "Түүх",
            "МХУЗ",
            "Мэдээлэл зүй",
            "Технологи",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "МХУЗ",
            "Математик",
            "МХУЗ",
            "Мэдээлэл зүй",
            "Технологи",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "МХУЗ",
            "Математик",
            "Дүрслэх урлаг",
            "МХУЗ",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "ИЁЗБ", "Хими", "Хөгжим", "МХУЗ", "Математик"],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "Орос хэл",
            "Хими",
            "Англи хэл",
            "Түүх",
            "ИЁЗБ",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Орос хэл",
            "Хими",
            "Англи хэл",
            "Биеийн тамир",
            "ИЁЗБ",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "MT", "Хими", "", "Биеийн тамир", ""],
        },
      ],
    },
    {
      class: "7а",
      pic: "",
      aub: "Н.Чагцалмаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Математик",
            "МХУЗ",
            "MT",
            "Хими",
            "Биеийн тамир",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Математик",
            "МХУЗ",
            "Орос хэл",
            "Хими",
            "Биеийн тамир",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Мэдээлэл зүй",
            "Англи хэл",
            "Орос хэл",
            "Биологи",
            "Технологи",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Мэдээлэл зүй",
            "Математик",
            "Англи хэл",
            "МХУЗ",
            "Түүх",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "ИЁЗБ",
            "Математик",
            "Англи хэл",
            "МХУЗ",
            "МХУЗ",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "Түүх", "Газарзүй", "Түүх", "Биологи", "МХУЗ"],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "Түүх", "Хөгжим", "", "Биологи", ""],
        },
      ],
    },
    {
      class: "7б",
      pic: "",
      aub: "М.Баасанбат",
      huwaari: [
        // 1r tsag
        {
          time: ["14:00-14:40", "МХУЗ", "Хими", "Түүх", "Математик", "Биологи"],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "МХУЗ", "Хими", "Биологи", "Математик", "Түүх"],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Англи хэл",
            "Математик",
            "Биологи",
            "МХУЗ",
            "MT",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Англи хэл",
            "Математик",
            "Технологи",
            "МХУЗ",
            "MT",
          ],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "Түүх", "MT", "Түүх", "Орос хэл", "МХУЗ"],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Биеийн тамир",
            "Хөгжим",
            "Нийгэм/ИЁЗБ",
            "Орос хэл",
            "МХУЗ",
          ],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "Биеийн тамир",
            "Газарзүй",
            "",
            "Англи хэл",
            "",
          ],
        },
      ],
    },
    {
      class: "7в",
      pic: "",
      aub: "Ц.Отгонбямба",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Биологи",
            "Мэдээлэл зүй",
            "Биологи",
            "Математик",
            "МХУЗ",
          ],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "Биологи", "МХУЗ", "МХУЗ", "Математик", "МХУЗ"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "Түүх", "МХУЗ", "МХУЗ", "Хими", "ИЁЗБ"],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Математик",
            "Хөгжим",
            "Англи хэл",
            "Хими",
            "Англи хэл",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "Математик",
            "Газарзүй",
            "Англи хэл",
            "МХУЗ",
            "Түүх",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Англи хэл",
            "Мэдээлэл зүй",
            "Технологи",
            "МХУЗ",
            "Түүх",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "Англи хэл", "Мэдээлэл зүй", "", "Түүх", ""],
        },
      ],
    },
    {
      class: "6а",
      pic: "",
      aub: "Л.Содгэрэл",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Биеийн тамир",
            "МХУЗ",
            "МХУЗ",
            "МХУЗ",
            "Нийгэм/ИЁЗБ",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Биеийн тамир",
            "MT",
            "МХУЗ",
            "Технологи",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "МХУЗ",
            "Математик",
            "Хими",
            "Технологи",
            "МХУЗ",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "МХУЗ",
            "Математик",
            "Хөгжим",
            "Англи хэл",
            "МХУЗ",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "Англи хэл",
            "Технологи",
            "Нийгэм/ИЁЗБ",
            "Англи хэл",
            "Англи хэл",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Биеийн тамир",
            "Биологи",
            "МХУЗ",
            "Математик",
            "Англи хэл",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "6б",
      pic: "",
      aub: "С.Пүрэвсувд",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "МХУЗ",
            "Математик",
            "Математик",
            "МХУЗ",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "МХУЗ",
            "Математик",
            "Хими",
            "Технологи",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Нийгэм/ИЁЗБ",
            "Англи хэл",
            "MT",
            "Технологи",
            "МХУЗ",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Биологи",
            "Биеийн тамир",
            "Нийгэм/ИЁЗБ",
            "Англи хэл",
            "МХУЗ",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "Биеийн тамир",
            "Биеийн тамир",
            "Хөгжим",
            "Англи хэл",
            "Физик",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Нийгэм/ИЁЗБ",
            "Технологи",
            "МХУЗ",
            "МХУЗ",
            "Математик",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "6в",
      pic: "",
      aub: "Х.Энхболд",
      huwaari: [
        // 1r tsag
        {
          time: ["14:00-14:40", "МХУЗ", "Биологи", "Хими", "МХУЗ", "МХУЗ"],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Математик",
            "МХУЗ",
            "Математик",
            "МХУЗ",
            "МХУЗ",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Математик",
            "МХУЗ",
            "Математик",
            "Англи хэл",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Биеийн тамир",
            "Технологи",
            "Англи хэл",
            "MT",
            "Нийгэм/ИЁЗБ",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "Биеийн тамир",
            "Биеийн тамир",
            "Англи хэл",
            "Физик",
            "Технологи",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "Математик",
            "Хөгжим",
            "Нийгэм/ИЁЗБ",
            "Түүх",
            "Технологи",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "5а",
      pic: "",
      aub: "Г.Хандармаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Математик",
            "Хүн нийгэм",
            "Монгол хэл",
            "Монгол хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол хэл",
            "Биеийн тамир",
            "Математик",
            "Математик",
            "Монгол хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Биеийн тамир",
            "Математик",
            "Англи хэл",
            "Хүн байгаль",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Англи хэл",
            "Дүрслэх урлаг, технологи",
            "Хөгжим",
            "Англи хэл",
            "Хүн байгаль",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Оюуны оньс",
            "Дүрслэх урлаг, технологи",
            "Эрүүл мэнд",
            "БЗЦ",
            "",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "5б",
      pic: "",
      aub: "Ж.Идэр",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол хэл",
            "Англи хэл",
            "Монгол ёс хүмүүжил",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Математик",
            "Хүн нийгэм",
            "Англи хэл",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол хэл",
            "Дүрслэх урлаг, технологи",
            "Хүн нийгэм",
            "Математик",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Дүрслэх урлаг, технологи",
            "Хөгжим",
            "Монгол хэл",
            "Хүн байгаль",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Англи хэл",
            "Биеийн тамир",
            "Эрүүл мэнд",
            "Монгол хэл",
            "Хүн байгаль",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Оюуны оньс",
            "Биеийн тамир",
            "Пиона",
            "БЗЦ",
            "Монгол хэл",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },

    {
      class: "5в",
      pic: "",
      aub: "Б.Билэгжаргал",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "Монгол ёс хүмүүжил",
            "Биеийн тамир",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Англи хэл",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Биеийн тамир",
            "Хүн орчин",
            "Монгол хэл",
            "Англи хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол хэл",
            "Монгол хэл",
            "Хүн орчин",
            "Монгол хэл",
            "Пиона",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Оюуны оньс",
            "Математик",
            "Математик",
            "Математик",
            "Пиона",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Математик",
            "Дүрслэх урлаг, технологи",
            "Эрүүл мэнд",
            "Хүн байгаль",
            "Монгол хэл",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Англи хэл",
            "Дүрслэх урлаг, технологи",
            "Хөгжим",
            "Хүн байгаль",
            "Математик",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "4а",
      aub: "Б.Батцэцэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
            "Математик",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Математик",
            "Математик",
            "Монгол ёс хүмүүжил",
            "Биеийн тамир",
            "Хүн байгал",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Монгол ёс хүмүүжил",
            "Хүн нийгэм",
            "Дүрслэх урлаг ",
            "Биеийн тамир",
            "Хүн байгал",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "ЭМ",
            "Хөгжим",
            "Дүрслэх урлаг технологи",
            "Хөгжим",
            "пиано",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "БЗЦ", "", "", "", "пиано"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "4б",
      aub: "С.Болормаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол ёс хүмүүжил",
            "Хөгжим",
            "пиано",
            "Монгол ёс хүмүүжил",
            "пиано",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Математик",
            "Хөгжим",
            "Математик",
            "Математик",
            "Оюуны оньс",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Монгол хэл",
            "Биеийн тамир",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол хэл",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Хүн байгал",
            "Биеийн тамир",
            "Дүрслэх урлаг технологи",
            "Хүн нийгэм",
            "БЗЦ",
          ],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "Хүн байгал",
            "",
            "Дүрслэх урлаг технологи",
            "",
            "",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "4в",
      aub: "Б.Золжаргал",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Хүн байгал",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Оюуны оньс",
            "Математик",
            "Хүн нийгэм",
            "Математик",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Хүн байгал",
            "Дүрслэх урлаг технологи",
            "Хөгжим",
            "пиано",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "ЭМ",
            "Математик",
            "Дүрслэх урлаг технологи",
            "Биеийн тамир",
            "Монгол ёс хүмүүжил",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "Драм", "БЗЦ", "Бүжиг", "Биеийн тамир", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "Бүжиг", "", "", ""],
        },
      ],
    },
    {
      class: "3а",
      aub: "Б.Бадрангуа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Монгол хэл",
            "Биеийн тамир",
            "Дүрслэх урлаг, технологи",
            "Биеийн тамир",
            "Монгол хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Монгол хэл",
            "Монгол хэл",
            "Дүрслэх урлаг, технологи",
            "Математик",
            "Математик",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Математик",
            "Edu",
            "Хөгжим",
            "Хүн орчин",
            "Математик",
          ],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "БЗЦ", "Математик", "Хөгжим", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "", "Бүжиг", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "Бүжиг", ""],
        },
      ],
    },
    {
      class: "3б",
      aub: "Б.Отгонцэцэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Биеийн тамир",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Математик",
            "Монгол хэл",
            "Хөгжим",
            "Монгол хэл",
            "Хөгжим",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Монгол хэл",
            "Биеийн тамир",
            "Математик",
            "Хүн орчин",
            "Монгол хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Монгол хэл",
            "Математик",
            "Дүрслэх урлаг, технологи",
            "Монгол хэл",
            "Бүжиг",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "БЗЦ",
            "Хүн орчин",
            "Дүрслэх урлаг, технологи",
            "Математик",
            "Бүжиг",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "Бүжиг", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "Бүжиг", "", "", "", ""],
        },
      ],
    },
    {
      class: "3в",
      aub: "С.Дэлгэрмөрөн",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Биеийн тамир",
            "Монгол ёс хүмүүжил",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Математик",
            "Хөгжим",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Монгол хэл",
            "Монгол хэл",
            "Хөгжим",
            "Биеийн тамир",
            "Монгол хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Математик",
            "Дүрслэх урлаг, технологи",
            "Хүн орчин",
            "Хүн орчин",
            "Бүжиг",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "БЗЦ",
            "Дүрслэх урлаг, технологи",
            "Edu",
            "Монгол хэл",
            "Бүжиг",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "Бүжиг", "", "", "Бүжиг", "Бүжиг"],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "Бүжиг", "", "", "Бүжиг", ""],
        },
      ],
    },
    {
      class: "2а",
      aub: "М.Эрдэнэцэцэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Хүн орчин",
            "Монгол хэл",
            "Edu",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Биеийн тамир",
            "Математик",
            "Хүн орчин",
            "Хөгжим",
            "Биеийн тамир",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Хөгжим",
            "Бүжиг",
            "Дүрслэх урлаг технологи",
            "Монгол хэл",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "СӨ",
            "Бүжиг",
            "Бүжиг",
            "Дүрслэх урлаг технологи",
            "Монгол хэл",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "IQ", "Бүжиг", "", "Математик", "БЗЦ"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "2б",
      aub: "Ц.Буяндүүрэн",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол хэл",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Монгол хэл",
            "Монгол хэл",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Edu",
            "Монгол хэл",
            "Хүн орчин",
            "Хөгжим",
            "Математик",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Дүрслэх урлаг технологи",
            "Монгол хэл",
            "Хүн орчин",
            "Математик",
            "Биеийн тамир",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Биеийн тамир",
            "Математик",
            "Бүжиг",
            "Хүн орчин",
            "БЗЦ",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Бүжиг",
            "Дүрслэх урлаг технологи",
            "Монгол ёс хүмүүжил",
            "Дүрслэх урлаг технологи",
            "IQ",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "Бүжиг", "СӨ", "", "Бүжиг", "IQ"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "Бүжиг", ""],
        },
      ],
    },
    {
      class: "2в",
      aub: "Э.Чулуунцэцэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "08:30-9:10",
            "Монгол хэл",
            "Хүн орчин",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "09:15-09:55",
            "Монгол ёс хүмүүжил",
            "Edu",
            "Дүрслэх урлаг технологи",
            "Хүн орчин",
            "Биеийн тамир",
          ],
        },
        // 3r tsag
        {
          time: [
            "10:00-10:40",
            "Монгол ёс хүмүүжил",
            "Хөгжим",
            "Дүрслэх урлаг технологи",
            "Математик",
            "Монгол хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "Математик",
            "Монгол хэл",
            "Математик",
            "Хөгжим",
            "Монгол хэл",
          ],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "Биеийн тамир",
            "Монгол хэл",
            "",
            "БЗЦ",
            "Бүжиг",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "Бүжиг", "СӨ", "", "Бүжиг", "Бүжиг"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "Бүжиг", "", "", "Бүжиг", ""],
        },
      ],
    },
    {
      class: "1а",
      aub: "Г.Хандармаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Монгол хэл",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Хөгжим",
            "Биеийн тамир",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Математик",
            "Дүрслэх урлаг технологи",
            "Монгол ёс хүмүүжил",
            "Хөгжим",
            "Монгол хэл",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "СӨ",
            "Дүрслэх урлаг технологи",
            "Монгол ёс хүмүүжил",
            "Биеийн тамир",
            "Хүн орчин",
          ],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "БЗЦ", "", "", "Хүн орчин"],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "1б",
      aub: "Б.Бүжмаа",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Хөгжим",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Хөгжим",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Математик",
            "Биеийн тамир",
            "Дүрслэх урлаг технологи",
            "Биеийн тамир",
            "Хүн орчин",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Монгол ёс хүмүүжил",
            "Монгол хэл",
            "Дүрслэх урлаг технологи",
            "Монгол хэл",
            "Хүн орчин",
          ],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "СӨ", "Монгол ёс хүмүүжил", "", "БЗЦ"],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "Монгол ёс хүмүүжил", "", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
    {
      class: "1в",
      aub: "Б.Ганчимэг",
      huwaari: [
        // 1r tsag
        {
          time: [
            "14:00-14:40",
            "Математик",
            "Монгол хэл",
            "Математик",
            "Монгол хэл",
            "Математик",
          ],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Монгол хэл",
            "Монгол хэл",
            "Дүрслэх урлаг технологи",
            "Хүн орчин",
            "Хөгжим",
          ],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "Биеийн тамир",
            "Хөгжим",
            "Монгол хэл",
            "Математик",
            "Биеийн тамир",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "Хүн орчин",
            "Математик",
            "Монгол ёс хүмүүжил",
            "Хөгжим",
            "Дүрслэх урлаг технологи",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "",
            "БЗЦ",
            "",
            "Монгол ёс хүмүүжил",
            "Дүрслэх урлаг технологи",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", ""],
        },
      ],
    },
  ]);
  return (
    <ClassContext.Provider value={{ classes, setClasses }}>
      {children}
    </ClassContext.Provider>
  );
};

// Context-ийг ашиглах hook
export const useClass = () => {
  const context = useContext(ClassContext);
  if (!context) throw new Error("useClass must be used within a ClassProvider");
  return context;
};
