// context/TeacherContext.js
"use client";

import { createContext, useContext, useState } from "react";

// Context үүсгэх
const TeacherContext = createContext();

// Provider Component
export const TeacherProvider = ({ children }) => {
  const [teachers, setTeachers] = useState([
    {
      teacherName: "М.Туул",
      pic: "./tuul.jpg",
      class: "12а",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Мэдээллийн технологи",
      number: 94119604,
      tbUgluu: [
        { time: ["08:30-09:30", "", "10в", "", "", ""] },
        { time: ["09:15-09:55", "", "", "", "", ""] },
        { time: ["10:00-10:40", "", "", "10б", "9б", "12а"] },
        { time: ["10:55-11:35", "", "", "", "", "12б"] },
        { time: ["11:40-12:20", "11а", "", "", "9а", ""] },
        { time: ["12:25-13:05", "", "", "", "", ""] },
        { time: ["13:10-13:50", "11б", "", "10а", "", "Шуурхай цуглаан"] },
      ],
      tbUdur: [
        { time: ["14:00-14:40", "", "7в", "7а", "8в", "МХБ Хөгжил"] },
        { time: ["14:45-15:25", "", "6а", "", "8в", "МХБ Хөгжил"] },
        { time: ["15:30-16:10", "7а", "", "6б", "", "7б"] },
        { time: ["16:25-17:05", "7а", "", "БУЗАН Ажил 121", "6в", "7б"] },
        { time: ["17:10-17:50", "", "7б", "БУЗАН Ажил 121", "8а", ""] },
        { time: ["17:55-18:35", "", "7в", "БУЗАН Ажил 121", "8б", ""] },
        {
          time: [
            "18:40-19:20",
            "8в",
            "7в",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "С.Пүрэвсувд",
      pic: "./purevsuvd.jpg",
      class: "6б",
      zereg: "Заах аргач",
      zan: "Нийгмийн ухаан",
      hicheel: "МХУЗ",
      number: 88331519,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "10в", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "10в", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "6-р анги Хөгжүүлэх сургалт", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "6-р анги Хөгжүүлэх сургалт", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "10в", "", "10в Сонгон"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "10в", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "6б", "7а", "8а", "6б", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "6б", "7а", "8а", "8а", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "МХБ Хөгжил", "8а", "6б"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "НУЗАН Ажил 121", "МХБ Хөгжил", "7а", "6б"],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "8а",
            "НУЗАН Ажил 121",
            "МХБ Хөгжил",
            "7а",
            "7а",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "8а", "НУЗАН Ажил 121", "6б", "6б", "7а"],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "НУЗАН Ажил 121",
            "",
            "6б Ангитай ажиллах цаг",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Б.Болормаа",
      pic: "./bolormaa.JPG",
      class: "11Б",
      zereg: "Тэргүүлэх",
      zan: "Нийгмийн ухаан",
      hicheel: "МХУЗ",
      number: 95507171,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "11б", "", "11б"],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "11б", "", "11б"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "11б Сонгон", ""],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "",
            "",
            "11б Ангитай ажиллах цаг",
            "11б Сонгон",
            "Шуурхай цуглаан",
          ],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "6а", "", "7в"],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "7в", "6а", "8б", "7в"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "6а", "7в", "МХБ Хөгжил", "8б", "8б"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "6а", "НУЗАН Ажил", "МХБ Хөгжил", "", "8б"],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "8б", "НУЗАН Ажил", "МХБ Хөгжил", "7б", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "НУЗАН Ажил", "6б", "7б", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "НУЗАН Ажил",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Н.Бат-Уянга",
      pic: "./batuyanga.jpg",
      class: "9а",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Математик",
      number: 80192552,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "9а", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "9а", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "4в Хөгжүүлэх сургалт", "10б", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "2в Хөгжүүлэх сургалт", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "",
            "9а Ангитай ажиллах цаг",
            "",
            "",
            "Шуурхай цуглаан",
          ],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "7а", "1б Хөгжүүлэх сургалт", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "7а", "", "", "", "4б Хөгжүүлэх сургалт"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "10б Сонгон", "МХБ Хөгжил", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "7а", "", "МХБ Хөгжил", ""],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "1а Хөгжүүлэх сургалт",
            "7а",
            "",
            "МХБ Хөгжил",
            "1в Хөгжүүлэх сургалт",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "6в Хөгжүүлэх сургалт",
            "",
            "",
            "МХБ Хөгжил",
            "6б Хөгжүүлэх сургалт",
          ],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", "Багш нарын эрүүл мэндийн цаг"],
        },
      ],
    },
    {
      teacherName: "Б.Янжиндулам",
      pic: "./yanjindulam.jpg",
      class: "",
      zereg: "Заах аргач",
      hicheel: "Хөгжим",
      zan: "Авьяас технологи",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "9б", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "9а", "", "", "", ""],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "МХБ Ажил", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "МХБ Ажил", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "МХБ Ажил", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "АТЗАН Ажил", "7в", "", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "АТЗАН Ажил", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "АТЗАН Ажил", "", "", "7б", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "АТЗАН Ажил",
            "",
            "",
            "7а",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Б.Цэвээнсүрэн",
      pic: "./tseveensuren.jpg",
      class: "10а",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Биологи",
      number: 80081202,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "10б", "", "10в", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "10б", "", "10в", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "12аб Сонгон", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "10а Сонгон", "12аб Сонгон", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "10а Сонгон", "", "", ""],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "МХБ Хөгжил", "", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "МХБ Хөгжил", "", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "МХБ Хөгжил", "", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "8в", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "8в",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Б.Дуламжав",
      pic: "dulamjav.jpg",
      class: "8б",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Математик",
      number: 91116706,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "12а", "", "12б", "", "12а"],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "12а", "", "12б", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", "12б"],
        },
        // 4r tsag
        {
          time: [
            "10:55-11:35",
            "5б хөгжүүлэх сургалт",
            "",
            "5в хөгжүүлэх сургалт",
            "",
            "",
          ],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "5а хөгжүүлэх сургалт", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "12аб сонгон", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "12аб сонгон", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "",
            "8б Ангитай ажиллах цаг",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Э.Энхсайхан",
      pic: "./enhsaihan.JPG",
      class: "",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Биеийн тамир",
      number: 80245544,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "9б", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "9б", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "9а", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "9а", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "6а", "Сагс Хөгжүүлэх сургалт", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "Сагс Хөгжүүлэх сургалт", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "6б", "БУЗАН Ажил 121", "8б", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "6б", "6б", "БУЗАН Ажил 121", "8б", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "6а", "8а", "БУЗАН Ажил 121", "8в", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "8а",
            "",
            "8в",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Л.Содгэрэл",
      pic: "./sodgerel.jpg",
      class: "6а",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Математик",
      number: 88696912,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "11б", "11а", "", "", "11б"],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "11б", "11а", "11а Сонгон", "", "11а"],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "2а Хөгжүүлэх сургалт",
            "",
            "11а Сонгон",
            "",
            "",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "2б Хөгжүүлэх сургалт", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "3а Хөгжүүлэх сургалт", "", "", "6а", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "3б Хөгжүүлэх сургалт", "", "", "6а", "6а"],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "3в Хөгжүүлэх сургалт",
            "6а",
            "",
            "МХБ Хөгжил",
            "",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "11б Сонгон",
            "6а",
            "БУЗАН Ажил",
            "МХБ Хөгжил",
            "",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "11б Сонгон",
            "",
            "БУЗАН Ажил",
            "МХБ Хөгжил",
            "",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "6а", "МХБ Хөгжил", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "",
            "",
            "6а Ангитай ажиллах цаг",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Б.Цэрмаа",
      pic: "./tsermaa.jpg",
      class: "8в",
      zereg: "Тэргүүлэх",
      zan: "Нийгмийн ухаан",
      hicheel: "МХУЗ",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "9а", "", "", "", "11а"],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "9а", "", "", "", "11а"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "11а", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "11а", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["08:30-09:30", "6в", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "8в", "6в", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "8в", "6в", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "МХБ Хөгжил", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "МХБ Хөгжил", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "МХБ Хөгжил", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "",
            "МХБ Хөгжил",
            "8в Ангитай ажиллах цаг",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Д.Отгонзул",
      pic: "./otgonzul.JPG",
      class: "11а",
      zereg: "",
      zan: "Нийгмийн ухаан",
      hicheel: "Англи хэл",
      number: 88577222,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", "5а Группээр хичээллэх цаг"],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", "5а Группээр хичээллэх цаг"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "5в Группээр хичээллэх цаг", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "11а", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "11б Сонгон", "11а", "11б"],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "11б", "11б Сонгон", "", "11а"],
        },
        // 7r tsag
        {
          time: [
            "13:10-13:50",
            "",
            "11б",
            "11а Ангитай ажиллах цаг",
            "",
            "Шуурхай цуглаан",
          ],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "МХБ Ажил", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "МХБ Ажил", "11а Сонгон", ""],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "",
            "6б Группээр хичээллэх цаг",
            "МХБ Ажил",
            "11а Сонгон",
            "",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "",
            "НУЗАН Ажил 121",
            "",
            "6б",
            "7в Группээр хичээллэх цаг",
          ],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "НУЗАН Ажил 121", "", "6б", ""],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "7в  Группээр хичээллэх цаг",
            "НУЗАН Ажил 121",
            "",
            "",
            "",
          ],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "7в Группээр хичээллэх цаг",
            "НУЗАН Ажил 121",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Ц.Отгонбямба",
      pic: "./otgonbyamba.JPG",
      class: "7в",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн ухаан",
      hicheel: "Хими",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "11б", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "11б", "", "11а", "10б"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "9б", "11а", "10б"],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "9б", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "10в", "9а", "10а", "", "12аб Сонгон"],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "10в", "9", "10а", "10а", "12аб Сонгон"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "9а", "10а", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "12аб Сонгон", "7б", "6в", "7а", "11аб Сонгон"],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "12аб Сонгон", "7б", "6б", "7а", "11аб Сонгон"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "МХБ Хөгжил", "", "6а", "7в", "8а"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "МХБ Хөгжил", "8а", "БУЗАН Ажил", "7в", "8а"],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "8а", "БУЗАН Ажил", "", "8б"],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "12аб Сонгон", "БУЗАН Ажил", "", "8б"],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "12аб Сонгон",
            "7в Ангитай ажиллах цаг",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Т.Баасансүрэн",
      pic: "./baasansuren.jpg",
      class: "",
      zereg: "",
      hicheel: "Дизайн технологи",
      zan: "Нийгмийн ухаан",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", "Багш нарын эрүүл мэндийн цаг"],
        },
      ],
    },
    {
      teacherName: "Э.Оюундарь",
      pic: "./oyundari.jpg",
      class: "",
      zereg: "Залуу багш",
      zan: "Авьяас технологи",
      hicheel: "Хөгжим",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "МХБ Хөгжил", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "1б", "", "МХБ Хөгжил", "1б"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "1в", "", "МХБ Хөгжил", "1а"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "АТЗАН Ажил", "", "6а", "", "1в"],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "АТЗАН Ажил", "", "6б", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "АТЗАН Ажил", "6в", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "АТЗАН Ажил",
            "",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Н.Батзаяа",
      pic: "./batzaya.jpg",
      class: "12Б",
      zereg: "Заах аргач",
      zan: "Нийгмийн ухаан",
      hicheel: "МХУЗ",
      number: 89503232,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "10б", "", "", "12б", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "10б", "", "", "12б", "10а"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", "10б"],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "12б", "", "", "", "10б"],
        },
        // 5r tsag
        {
          time: [
            "11:40-12:20",
            "12б",
            "",
            "12б Ангитай ажиллах цаг",
            "10а",
            "10б",
          ],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", "10б Сонгон"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "10а сонгон", "", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "НУЗАН Ажил 121", "МХБ Хөгжил", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "НУЗАН Ажил 121", "МХБ Хөгжил", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "НУЗАН Ажил 121", "МХБ Хөгжил", "", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "НУЗАН Ажил 121",
            "МХБ Хөгжил",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Т.Гантөмөр",
      pic: "./gantomor.jpg",
      class: "",
      zereg: "Заах аргач",
      zan: "Авьяас технологи",
      hicheel: "Дүрслэх урлаг/Зураг зүй",
      number: 80666456,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "12б", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "11б", "10в", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "10а", "12а"],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "10б", "", "", "7б"],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "7а", "7в", "7б"],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "11а", "7а", "7в", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "Хар зураг Хөгжүүлэх сургалт", "", "", "", ""],
        },
        // 2r tsag
        {
          time: [
            "14:45-15:25",
            "Хар зураг Хөгжүүлэх сургалт",
            "",
            "",
            "6б",
            "",
          ],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "МХБ Хөгжил", "6б", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "АТЗАН Ажил", "", "МХБ Хөгжил", "6а", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "АТЗАН Ажил", "", "МХБ Хөгжил", "6а", "6в"],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "АТЗАН Ажил", "", "МХБ Хөгжил", "", "6в"],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "АТЗАН Ажил",
            "",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Х.Болд-Эрдэнэ",
      pic: "./bolderdene.jpg",
      class: "",
      zereg: "Тэргүүлэх",
      zan: "Байгалийн  ухаан",
      hicheel: "Математик",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "10б", "10а", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "10б", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", ""],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "10а сонгон", "6б", "", "7б", "6б"],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "6в", "6б", "", "7б", "6б"],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "6в", "7б", "", "МХБ Хөгжил", "6в"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "", "7б", "БУЗАН Ажил 121", "МХБ Хөгжил", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "", "", "БУЗАН Ажил 121", "МХБ Хөгжил", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "", "", "БУЗАН Ажил 121", "МХБ Хөгжил", ""],
        },
        // 7r tsag
        {
          time: ["18:40-19:20", "", "", "", "", "Багш нарын эрүүл мэндийн цаг"],
        },
      ],
    },
    {
      teacherName: "Т.Халиун",
      pic: "./haliun.jpg",
      class: "8а",
      zereg: "",
      hicheel: "Англи хэл",
      zan: "Нийгмийн ухаан",
      tbUgluu: [
        // 1r tsag
        {
          time: [
            "08:30-09:30",
            "",
            "10б",
            "10б",
            "",
            "5в Группээр хичээллэх цаг",
          ],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "10б", "", "5в Группээр хичээллэх цаг"],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "5в Группээр хичээллэх цаг", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "10б Сонгон", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "10б Сонгон", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "МХБ Хөгжил", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "МХБ Хөгжил", "", ""],
        },
        // 3r tsag
        {
          time: [
            "15:30-16:10",
            "",
            "6б Группээр хичээллэх цаг",
            "МХБ Хөгжил",
            "6в",
            "",
          ],
        },
        // 4r tsag
        {
          time: [
            "16:25-17:05",
            "",
            "НУЗАН Ажил",
            "6в",
            "6б Группээр хичээллэх цаг",
            "",
          ],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "6а Группээр хичээллэх цаг",
            "НУЗАН Ажил",
            "6в",
            "6б Группээр хичээллэх цаг",
            "6а",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "",
            "НУЗАН Ажил",
            "8а",
            "8а Группээр хичээллэх цаг",
            "6а",
          ],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "НУЗАН Ажил",
            "8а Ангиар ажиллах цаг",
            "8а Группээр хичээллэх цаг",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Х.Нямбат",
      pic: "./nyambat.jpg",
      class: "",
      zereg: "Тэргүүлэх",
      zan: "Авьяас технологи",
      hicheel: "Хөгжим",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "2в", "", "2б", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "2а", "", "2а", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "2б", "", "2в", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "", "", "", "", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "", "", "МХБ Хөгжил", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "", "", "МХБ Хөгжил", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "", "", "МХБ Хөгжил", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "АТЗАН Ажил", "", "8б", "", ""],
        },
        // 5r tsag
        {
          time: ["17:10-17:50", "АТЗАН Ажил", "", "8а", "", ""],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "АТЗАН Ажил", "", "", "", ""],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "АТЗАН Ажил",
            "",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Б.Бямбажав",
      pic: "./byambajav.jpg",
      class: "",
      zereg: "",
      zan: "Захиргаа",
      hicheel: "Архивын эрхлэгч, бичиг хэрэг",
    },
    {
      teacherName: "Н.Норжмаа",
      pic: "./norjmaa.jpg",
      class: "",
      zereg: "Заах аргач",
      zan: "Байгалийн ухаан",
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "9б", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "9б", "", "", "", ""],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "9а", "", "", "11б", ""],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "9а", "11а", "", "11б", ""],
        },
        // 6r tsag
        {
          time: ["12:25-13:05", "", "11а", "", "", ""],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "8в", "", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "7в", "6в", "8б", "8а", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "7в", "", "7б", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "", "МХБ Хөгжил", "7б", "", ""],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "6б", "МХБ Хөгжил", "БУЗАН Ажил 121", "", ""],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "",
            "МХБ Хөгжил",
            "БУЗАН Ажил 121",
            "",
            "11аб Сонгон",
          ],
        },
        // 6r tsag
        {
          time: [
            "17:55-18:35",
            "",
            "6а",
            "БУЗАН Ажил 121",
            "7а",
            "11аб Сонгон",
          ],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "",
            "",
            "7а",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
    {
      teacherName: "Г.Батцэцэг",
      pic: "./battsetseg.jpg",
      class: "",
      zereg: "Тэргүүлэх",
      zan: "Нийгмийн ухаан",
      hicheel: "Орос хэл/Англи хэл",
      number: 80511819,
      tbUgluu: [
        // 1r tsag
        {
          time: ["08:30-09:30", "", "", "", "5б Группээр хичээллэх цаг", ""],
        },
        // 2r tsag
        {
          time: ["09:15-09:55", "", "", "", "", ""],
        },
        // 3r tsag
        {
          time: ["10:00-10:40", "", "", "", "", "9а"],
        },
        // 4r tsag
        {
          time: ["10:55-11:35", "", "", "", "", "9а"],
        },
        // 5r tsag
        {
          time: ["11:40-12:20", "5б Группээр хичээллэх цаг", "", "", "", "9б"],
        },
        // 6r tsag
        {
          time: [
            "12:25-13:05",
            "5б Группээр хичээллэх цаг",
            "",
            "",
            "9б",
            "9б",
          ],
        },
        // 7r tsag
        {
          time: ["13:10-13:50", "", "", "", "9а", "Шуурхай цуглаан"],
        },
      ],
      tbUdur: [
        // 1r tsag
        {
          time: ["14:00-14:40", "", "8а", "", "", ""],
        },
        // 2r tsag
        {
          time: ["14:45-15:25", "", "8а", "7а", "", ""],
        },
        // 3r tsag
        {
          time: ["15:30-16:10", "8б", "", "7а", "", "МХБ Хөгжил"],
        },
        // 4r tsag
        {
          time: ["16:25-17:05", "8б", "НУЗАН Ажил 121", "7в", "", "МХБ Хөгжил"],
        },
        // 5r tsag
        {
          time: [
            "17:10-17:50",
            "8в",
            "НУЗАН Ажил 121",
            "7в",
            "7б",
            "МХБ Хөгжил",
          ],
        },
        // 6r tsag
        {
          time: ["17:55-18:35", "8в", "НУЗАН Ажил 121", "", "7б", "МХБ Хөгжил"],
        },
        // 7r tsag
        {
          time: [
            "18:40-19:20",
            "",
            "НУЗАН Ажил 121",
            "",
            "",
            "Багш нарын эрүүл мэндийн цаг",
          ],
        },
      ],
    },
  ]);
  return (
    <TeacherContext.Provider value={{ teachers, setTeachers }}>
      {children}
    </TeacherContext.Provider>
  );
};

// Custom hook ашиглахад хялбар болгох
export const useTeachers = () => useContext(TeacherContext);
